docs/pages/algorithm/graph/DFS.html
---
layout: default
title: DFS
nav_exclude: true
---
<div id="outline-container-org27de9ef" class="outline-2">
<h2 id="org27de9ef"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
DFS is a recursive or stack-based algorithm used to traverse or search through a graph/tree.
The following is ususally the steps for DFS to traverse all the nodes in the graph.
</p>
<div class="org-src-container">
<pre class="src src-nil">1. Start at a node (usually the source).
2. Mark the node as visited.
3. Recursively (or via stack) visit each unvisited neighbor.
4. Backtrack when all neighbors are explored.
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb113edc" class="outline-2">
<h2 id="orgb113edc"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Code template</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-nil">
</pre>
</div>
</div>
</div>
